kadway/stm32f4-freertos-plant-monitor/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include <stdio.h>
#include <string.h>
#include <inttypes.h>

#include "stm32f4xx_hal.h"
#include "w25qxx.h"
#include "cmsis_os.h"
#include "adc.h"
#include "dma.h"
#include "spi.h"
#include "i2c.h"
#include "rtc.h"
#include "usart.h"
#include "gpio.h"
#include "configuration.h"
#include "control.h"
#include "measurement.h"
#include "communication.h"
#include "ds3231.h"

extern osThreadId spiEspComTaskHandle;
extern osThreadId adcTaskHandle;
extern osThreadId controlTaskHandle;
extern osSemaphoreId spiEspSemphHandle;
extern osSemaphoreId adcSemphHandle;
extern osMutexId flashMutexHandle;

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#define PRINTF_DEBUG 1
#define PRINTF_DEBUG_ACT 0
#define PRINTF_DEBUG_ACT_FLASH 0
#define PRINTF_DEBUG_ADC 0
#define PRINTF_DEBUG_ADC_FLASH 0
#define PRINTF_DEBUG_COM 0
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */


/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
